{"armenui-paglevanyan":{"city":"Пенза","about":"Привет! Меня зовут Армине! Я родилась в Гюмри, Армения. В 14 лет, после землетрясения, переехала с родителями в Пензу. На 3-м курсе в вузе мне предложили работать в ИВЦ (информационно-вычислительный центр университета).\\n\\nУчилась я на программиста, в ИВЦ занималась сайтом университета, электронными учебниками, разработкой программ. Участвовала со своими разработками в конкурсах, занимала призовые места.\\n\\nПервым серьёзным проектом в 2002 г. был сайт знакомств со встроенным переводчиком.\\n\\nС 2004г. начала работу над крупным собственным проектом: разработка сайта, посвященного Армянскому языку, литературе и т. д. В свободное время занимаюсь им. Хочу переписать сам сайт и сделать мобильную версию. Сайт пользуется большим спросом и сейчас, хочется сделать его более современным и удобным для пользователей.\\n\\nC лета 2007 г. своя веб студия. Было очень много совершенно разных проектов, от сайтов-визиток до магазинов, от верстки до сайтов под ключ.\\n\\nВ это же время вела факультативы по веб-технологиям в школе. Учила детей HTML, CSS, JS, Flash - анимация\/программирование  (AS1-AS3). Было очень интересно работать с ними.\\n\\nПочти два года как переехала в Москву. Работаю арт-директором в отделе рекламы и маркетинга, работаю с несколькими организациями по договорам, веду собственный проект Your Skills\\n\\n\\nВ ШРИ надеюсь получить опыт серьезной промышленной веб-разработки, и представление о внутренних процессах Yandex.","link_photo":"armenui-paglevanyan.jpg","link_facebook":"https:\/\/www.facebook.com\/arminename","link_vk":"http:\/\/vk.com\/paglevanyan","link_gihub":"https:\/\/github.com\/arminename","link_yaru":"http:\/\/paglevanian.ya.ru\/","name":"Арменуи Паглеванян"},"andrey-morozov":{"city":"Ставрополь","about":"Учусь на 3-ем курсе в МАТИ - РГТУ им. К.Э. Циолковского по специальности \"Информатика и вычислительная техника\". Впервые столкнулся с версткой на 2-ом курсе. Нам преподавали курс под названием \"WEB-технологии\", в рамках которого были HTML и CSS. Мне безумно понравилось верстать. И я точно решил, что моя будущая работа будет связана с вебом.","link_photo":"andrey-morozov.jpg","link_facebook":"https:\/\/www.facebook.com\/1uckytrue","link_vk":"https:\/\/vk.com\/luckytrue","link_gihub":"https:\/\/github.com\/LuckyTrue","link_yaru":"http:\/\/luckytrue.ya.ru\/","name":"Андрей Морозов"},"aleksey-kondratov":{"city":"Москва","about":"После школы поступил в Московский инженерно-физический институт, но потом его переименовали, и закончил в 2012 году я уже Национальный исследовательский ядерный университет \"МИФИ\", став магистром прикладной математики и физики. Потом я поступил в аспирантуру одного из институтов физического отделения РАН, где и учусь в настоящее время.\\n\\nЧто касается веб-разработки, то первый сайт я сделал в школе для какого-то местного конкурса, а делал я его в страшной штуке под названием Microsoft FrontPage. Затем я забыл о вебе очень надолго, в институте достаточно много программировал на Pascal, Fortran + MPI\/OpenMP, Python, MATLAB, Wolfram Mathematica, но в основном это сводилось к решению разных математических\/физических задач.\\n\\nВ конце 5-го курса института друзья позвали в маленький \"стартап\" по поиску и продаже туров онлайн. Там я и работаю уже больше 2-х лет, программирую на Ruby\/RoR, JS. Учуствовал как в фронтенд так и в бэкенд разработке различных проектов: сайт-знакомств, интернет-магазин, игру для Вконтакте, просто разные сайты, даже писал свою CMS для интернет-магазина.","link_photo":"aleksey-kondratov.jpg","link_facebook":"https:\/\/www.facebook.com\/ololobus","link_vk":"https:\/\/vk.com\/ololoshkiiii","link_gihub":"https:\/\/github.com\/ololobus","link_yaru":"http:\/\/alex-ololo.ya.ru\/","name":"Алексей Кондратов"},"marina-akimova":{"city":"Москва","about":"Родилась и живу в Москве. После школы закончила колледж по направлению менеджмент и о карьере в области IT как-то совсем не задумывалась=)\\nНедолго проучилась в негосударственном Вузе по направлению психологии, но быстро поняла, что предлагаемое образование мне и даром не нужно)\\nПоэтому взяла школьные книжки по математике и поучив ненавистную мне математику поступила в НИУ МЭИ на кафедру ММ:)\\nИнтересоваться веб-разработкой начала совсем недавно. Мне кинули ссылочку на описание первой школы, я загорелась идеей попасть сюда и к моей радости  - я тут)\\nЗдорово, что в ШРИ постоянно узнаешь что-то новое, и тем более от людей, которые являются фанатами своего дела=)","link_photo":"marina-akimova.jpg","link_facebook":"","link_vk":"http:\/\/vk.com\/id209848299","link_gihub":"https:\/\/github.com\/MaHTuCCa","link_yaru":"http:\/\/akimovamp.ya.ru\/","name":"Марина Акимова"},"ivan-polyuhovich":{"city":"Ярославль","about":"Меня зовут Иван, 23 года, родился в Ярославле, последние лет 10 живу в Москве. \\nВыпускник МГТУ им. Н.Э.Баумана. \\nСерьёзного опыта веб-разработки не имею, в Школу попал скорее от большого желания. В ШРИ надеюсь систематизировать знания, шире взглянуть на фронтенд-разработку и перенять опыт профессионалов. Спасибо Яндексу за предоставленную возможность.\\n","link_photo":"ivan-polyuhovich.jpg","link_facebook":"https:\/\/www.facebook.com\/iamfoont","link_vk":"http:\/\/vk.com\/merzavcev","link_gihub":"https:\/\/github.com\/merzavcev","link_yaru":"http:\/\/iamfoont.ya.ru\/","name":"Иван Полюхович"},"evgeniya-kostenko":{"city":"Москва","about":"Родилась на Украине, выросла в подмосковном Фрязино, затем поступила в МГУ на факультет вычислительной математики и кибернетики и окончательно перебралась в Москву.\\nНадеюсь, что ШРИ станет мощным стартом на моем пути разработчика.","link_photo":"evgeniya-kostenko.jpg","link_facebook":"http:\/\/www.facebook.com\/eugeshko","link_vk":"http:\/\/vk.com\/eugeshko","link_gihub":"https:\/\/github.com\/eugeshko","link_yaru":"http:\/\/eugeshko.ya.ru\/","name":"Евгения Костенко"},"sofiya-pavlenko":{"city":"Москва","about":"Я родилась и выросла в Москве. В школе любила информатику и математику, а в 9-м классе подружка позвала сходить на экзамен в лицей при МИФИ, в результате вопрос куда поступать сам собой отпал:) К сожалению, в институте было много теории и очень мало практики(и то Delphi). После защиты диплома я несколько лет работала не по специальности, но мне постоянно хотелось там что-то автоматизировать и я решила \"вернуться\", о чем совсем не жалею. \\n\\nСейчас у меня достаточно разнообразная работа: участвую в разработке десктопных приложений обработки информации(QT), работаю с картографическим материалом, геоинформационными системами, с недавнего времени пишу небольшие библиотеки на JS.  \\n\\nВ ШРИ я пришла, потому что мне очень интересна web-разработка, хочется учиться и развиваться в этой области, систематизировать отрывочные знания и попрактиковаться.","link_photo":"sofiya-pavlenko.jpg","link_facebook":"https:\/\/www.facebook.com\/sofiushko","link_vk":"http:\/\/vk.com\/sonja","link_gihub":"https:\/\/github.com\/sofiushko","link_yaru":"http:\/\/artsonja.ya.ru\/","name":"София Павленко"},"sergey-boronchiev":{"city":"Санкт-Петербург","about":"Меня зовут Сергей Борончиев (профиль на moikrug.ru). Я из Санкт-Петербурга, последние полтора года живу и работаю в Москве.\\n\\nВ 2007 году, когда я только начинал интересоваться веб-разработкой, побывал на третьей открытой встрече сообщества «Веб-стандарты» и решил, что хочу развиваться во фронтэнд-направлении. Читал много книг и тематических блогов, верстал свои первые сайты. Не застал IE5.5, но на поддержке IE6 закалился. Сделал настольной книгу с рыбами, книгу с носорогом откладывал до недавнего времени.\\n\\nС '09 по '12 годы я работал в небольших петербургских веб-студиях: верстал несложные сайты и программировал модули для популярных CMS, параллельно попробовал себя во всех смежных областях – от аналитики до интернет-рекламы.\\n\\nВ 2012 меня пригласили работать в LiveJournal (SUP Media) в качестве верстальщика. Я занимался версткой новых нежурнальных сервисов и поддержкой существующих. Последние полгода я руковожу одной из групп разработки ЖЖ.\\n\\nПоставил цель – развиться в комплексного фронтендера – разбираюсь с JS, интересуюсь методами повышения эффективности командной работы и управлением проектами. Коллеги, выпускники прошлого года, рекомендовали ШРИ, как отличный интенсив, охватывающий все аспекты разработки.","link_photo":"sergey-boronchiev.jpg","link_facebook":"","link_vk":"","link_gihub":"","link_yaru":"","name":"Сергей Борончиев"},"mihail-mokrushin":{"city":"Ижевск","about":"Меня зовут Михаил, мне 24 года, я из города Ижевск. Учился там же, в Ижевском Государственном Техническом Университете имени М.Т. Калашникова. На первом курсе стал интересоваться веб-дизайном, наверное это было как то связано с окончанием художественной школы. Слышал многое про про таких счастливых людей, как фрилансеры, которые не выходя из дома зарабатывают деньги, и казалось что это очень круто. Решил попробовать, первый заказ получил по верстке сайта, так и стал верстальщиком https:\/\/www.fl.ru\/users\/marsh\/. Проекты были различные, но большинство это типовые сайты и интернeт-магазины. Спустя пять лет понял, что это совсем не то, чем я хотел бы заниматься, что нужно развиваться и в смежных областях, и углубляться в javascript.\\n\\nСейчас работаю в одной компании над небольшим веб-приложением, в должности фронтенд разработчика, это мне кажется очень интересным, и хочется развиваться в этом направлении дальше. Именно поэтому я в ШРИ. Новые знания, новые знакомства, перспектива стажировки в Яндексе, это то, что я хотел получить от школы, а что-то уже и получил. Спасибо. Всем успехов в этом не легком, но чертовски интересном деле :)","link_photo":"mihail-mokrushin.jpg","link_facebook":"https:\/\/www.facebook.com\/mikhail.mokrushin","link_vk":"http:\/\/vk.com\/mishk0_m","link_gihub":"https:\/\/github.com\/mishk0","link_yaru":"http:\/\/mokrushin-mikhail.ya.ru","name":"Михаил Мокрушин"},"maksim-popkov":{"city":"Балашиха","about":"С детства вожусь с техникой, слежу за прогрессом и познаю новое. Мне нравятся веб-технологии, возможность увидеть результат работы и показать его другим. Школа стала для меня вектором в саморазвитии, направляет и помогает пробиться в джунглях front-end`а.","link_photo":"maksim-popkov.jpg","link_facebook":"","link_vk":"vk.com\/dales3d","link_gihub":"github.com\/maxim-popkov\/","link_yaru":"dales3d.ya.ru\/","name":"Максим Попков"},"mihail-kocievskiy":{"city":"Одесса","about":"Начал щупать верстку очень давно, но дальше сверстать шаблончик в ЖЖ таблицами однокурсницам за чашку кофе дело не заходило. По этому поводу я работал в далеких от IT сферах. Чуть меньше года назад прочел несколько книжек и устроился QA в аутсорсинговую компанию. Несколько месяцев назад меня перевили на должность разработчика на подхвате - сверстать чего, скриптик какой написать и т.п. \\n\\nЭту работу мне пришлось бросить ради ШРИ, но я совершенно ни о чем не жалею. За эти 10 дней в Москве я узнал больше, чем за 2 последних месяца на работе, у меня появилось время читать техническую литературу и вообще с классными ребятами познакомился.\\n\\nНадеюсь, удастся получить от этой авантюры еще больше.\\n\\nОчень сложно выбрать, направление, которое мне больше всего нравится в Яндексе. Лекторы как на подбор просто. До сегодня лидировал Поиск, но теперь хочу и в Маркет и в Оптимизацию.\\n\\nЯ решил всех поразить своим умением сверстать в HTML-режиме, но парсер все равно внес свои коррективы. Всем добра.","link_photo":"mihail-kocievskiy.jpg","link_facebook":"https:\/\/www.facebook.com\/maxvektor","link_vk":"http:\/\/vk.com\/kotsievsky","link_gihub":"https:\/\/github.com\/Kocijevsky","link_yaru":"http:\/\/m-kocijevsky.ya.ru\/","name":"Михаил Коциевский"},"aleksandr-nefedov":{"city":"Ярославль","about":"Родился и вырос в Ярославле. В этом году окончил ЯрГУ на факультете ИВТ.\\nКакое-то время писал на c++, немного участвовал в ACM.\\nБольше двух лет работаю в \"Тензоре\" веб-программистом. Начинал с каких-то простых страничек ещё во времена Netscape Navigator. Когда-то писал на php, немного на java, сейчас предпочитаю node.js. По работе в основном пишу\/отлаживаю клиентский javascript.","link_photo":"aleksandr-nefedov.jpg","link_facebook":"https:\/\/www.facebook.com\/garret.rus","link_vk":"http:\/\/vk.com\/id3157005","link_gihub":"https:\/\/github.com\/4eb0da","link_yaru":"garret-rus.ya.ru\/","name":"Александр Нефедов"},"pavel-kucherov":{"city":"Донецк","about":"19.07.1990 — вот дата, которая стала точкой отсчета всей моей жизни.\\n\\nВ школу я пошёл в 7 лет и где-то в это же время у меня появился первый компьютер. Это был списанный по состоянию здоровья 486-й. Т.к. на этом компьютере многие игры было невозможно запустить – я находил себе другое развлечение – помогал сестре выполнять школьные лабораторные по информатике (именно тогда я познакомился с Паскалем).\\n\\nЛет в 15 начал интересоваться Web-разработкой, первым достижением было сделать форму регистрации на PHP, а не просто страничку во FrontPage. Чтобы знания не пропадали даром, стал делать сайты на заказ и всё своё свободное время направил в web.\\n\\nВ 2007 году мои труды в обучении были вознаграждены поступлением в Донецкий национальный технический университет на специальность «Системное программирование».\\n\\nНа последнем курсе мы с одногруппниками стали не просто сокурсниками, а сплоченной командой, участвуя в различных Хакатонах в разных городах Украины. Наличие свободного времени, 50%-я скидка на проезд в поездах по студенческому были очень кстати. Ездили мы так ездили, и вот в ноябре 2012-го попали на хакатон в Киеве при поддержке Яндекса. К этому моменту я стал осознавать, что имею очень обширный знания в web-разработке, начиная от настройки серверов и заканчивая общением с заказчиками, но по сути не являясь экспертом ни в одной из них. Появилось чёткое осознание того, что хочу развиваться в области разработки, но как, я пока не представлял.\\n\\nНа том Хакатоне в Киеве мы заняли 1-ое место. Представитель Яндекса несколько раз пытался выяснить кто всё-таки у нас в команде JavaScript программист, который работал с Я.Картами. Мы не могли ему дать вразумительного ответа, т.к. под карты писал я, но я был ни какой-нибудь там JS программист, а я был PHP программист! Во как! )))\\n\\nНо после этого, всю дорогу домой, я думал, а может быть я и JS программист тоже? Решил это выяснить и заполнил заявку на стажировку в Яндекс на JS. В ответ на заявку прислали 2 тестовых задания на JS, вооружившись книгой Флэнегана - я их успешно выполнил и отправил. В ответ мне прислали ещё одно тестовое, но уже на nodejs. Про nodejs я знал только то, что он существует и по его поводу много холиваров на хабре. Вооружился книгой по nodejs и так же выполнил данное задание. Всё это заняло полтора месяца, и вот мне назначили собеседование по скайпу с киевским офисом. \\n\\nУвы, на стажировку меня не пригласили, зато я получил список литературы по JS, ссылку на лекции ШРИ и приглашение попробовать свои силы через некоторое время. Прочитал литературу, просмотрел лекции, для закрепления материала попробовал переписать распознавание автомобильных номеров на nodejs + OpenCV (даже чуть-чуть заработало) и незаметно для себя устроился работать в проект на nodejs, который по иронии судьбы, был косвенно связан с Яндексом (разработка робота на nodejs, для управления ставками в Я.Директе).\\n\\nС даты проведения последнего собеседования прошло полгода, и я решил для закрепления изученного и изучения неизученного пройти обучение в ШРИ.\\n\\nТестовую анкету я разрабатывал в течении месяца на BEMHTML (с которым до этого не работал), отправил заявку 15 августа и стал ждать. Через пару дней после закрытия приёма заявок мне позвонили из Я., сказали что анкета понравилась и предложили попробовать свои силы сразу на стажировку.\\n\\nПопробовал  Не взяли, сказали давай-ка ты сначала в ШРИ...\\n\\nИ вот я в ШРИ. Зачем я сюда пришёл? Однозначно, чтобы попасть наконец-то на стажировку!!! И без вариантов :)","link_photo":"pavel-kucherov.jpg","link_facebook":"https:\/\/www.facebook.com\/profile.php?id=100001765428961","link_vk":"http:\/\/vk.com\/id108239190","link_gihub":"https:\/\/github.com\/phpprog","link_yaru":"http:\/\/pskucherov.ya.ru\/","name":"Павел Кучеров"},"anna-minaeva":{"city":"Москва","about":"Веб-разработкой заинтересовалась еще в далекие школьные годы, самостоятельно начала изучать HTML, помогала друзьям делать сайты.\\nПосле окончания института пробовала себя в разных областях, попутно перевела с английского несколько книг, в том числе по CSS и проектированию интерфейсов. И все больше хотелось применить теорию на практике в серьезных проектах.Так хобби стало моей работой - на данный момент я занимаюсь разработкой и поддержкой сайтов крупной телекоммуникационной компании, больше всего пишу на XSLT и JavaScript.\\n\\nШРИ для меня прежде всего замечательная возможность узнать много нового, систематизировать свои знания и, конечно, познакомиться с интересными людьми, увлеченными своим делом.","link_photo":"anna-minaeva.jpg","link_facebook":"https:\/\/www.facebook.com\/rainybowls","link_vk":"","link_gihub":"https:\/\/github.com\/rainybowl","link_yaru":"http:\/\/rainybowl.ya.ru\/","name":"Анна Минаева"},"nataliya-smirnova":{"city":"Иркутск","about":"Всем привет. Я из семьи военного, дольше всего жила в Иркутске. В Москве с 2008 г. Закончила матфак Иркутского государственного университета. Программистом начала работать с 3 курса. Пошла в 1С-программирование. Но...тяжела и неказиста жизнь 1С-программиста. В основном потому, что часто приходится читать правовые базы типа Гаранта, вкапываться в тонкости ведения не только белого, но и черного учета, а это весьма богомерзкие занятия. Захотелось более абстрактной работы. И тут меня позвали в аспирантуру. В аспирантуре первые полтора года все равно пришлось заниматься 1С - внедряла в институте \"1С: Зарплата и кадры\". Тут приходилось быть не только программистом, но и дипломатом, потому что одновременно с этим в институте происходила реструктуризация бизнес-процессов в бухгалтерии и прочих околоуправленческих отделах. Довела программу до такого состояния, чтобы в ней можно было вести учет, и ушла в науку.\\n \\nНаучно-популярно часть своих научных изысканий описала тут: \\nhttp:\/\/habrahabr.ru\/post\/194240\/ Написала диссертацию. Теперь еще нужно выловить научного руководителя, чтобы он ее прочитал. Ну а пока разрабатываю подсистему проверки решений для обучающих программ: https:\/\/github.com\/indra-uolles\/solution_tracer. Хочу ее сделать в виде отдельного open-source компонента, а также попробовать его проинтегрировать с платформой EdX.\\n \\nШРИ привлекла прежде всего возможностью попасть на практику в Яндекс. Ну а если и не попаду туда, то в любом случае это будет хороший старт - после того, как допопуляризирую свои научные результаты, хочу пойти работать веб-разработчиком (в ближайшие 2-3 года хочется отдохнуть от алгоритмов и прокачать культуру разработки программного кода).","link_photo":"nataliya-smirnova.jpg","link_facebook":"https:\/\/www.facebook.com\/nataliasmirnova.natalia","link_vk":"http:\/\/vk.com\/id24213991","link_gihub":"https:\/\/github.com\/indra-uolles","link_yaru":"http:\/\/indra-uolles.ya.ru\/","name":"Наталия Смирнова"},"nikita-popov":{"city":"Санкт-Петербург","about":"Привет! Меня зовут Никита.\\n\\nВ детстве я хотел быть пожарным. Потом хотел быть дрессировщиком в цирке. Но годам примерно к десяти определился, что хочу быть программистом, как папа. Ну как определился, по-моему мне просто не оставили выбора. В мои 12 лет мы с папой писали тетрис на FoxPro 2.0. Потом был университет, матан, C#, .NET, работа в банке.\\n\\nПотом был Питер, там меня подсадили на Смолток. На нем мы писали наши вертолетные и самолетные тренажеры. Тренажер — это кабина настоящего, скажем, вертолета Ми-17. Она установлена внутри белой сферы, на которой восемью проекторами рисуется панорамный вид за окнами, в 3D. И все это стоит на платформе подвижности с пневматическими ногами.\\n\\nВосемь серверов в реальном времени считают динамику полета и имитируют работу всех систем вертолета, еще восемь серверов рисуют графику. Вся логика работает на смолтоке. Меня спрашивали, жив ли смолток сейчас. Так вот, очень даже жив.\\n\\nРабота была хорошая, интересная. Но я к тому моменту уже давно интересовался интерфейсами и юзабилити, а интерфейс нашего тренажера оставлял желать лучшего. И менять его было не очень нужно, потому что это не массовый продукт. Новым пользователям (обычно летным инструкторам — дядькам лет пятидесяти) выдавали инструкцию по пользованию и как бы неудобно там все ни было, делай по инструкции: будет работать.\\n\\nТак что я читал книжки по дизайну, по ночам рисовал красивые картинки в фотошопе, участвовал в конференциях, у нас даже был свой образовательный проект о UX-проектировании, назвался Experiemint. Но все равно заниматься этим в свободное время было недостаточно. Поэтому в декабре прошлого года я уволился, уехал в теплые края, где тепло и дешево (в отличие от Питера) и на несколько месяцев погрузился в мир веба. С тех пор не выныривал.\\n\\nЯ верю, что чтобы делать современные веб-приложения, не достаточно быть только веб-дизайнером или только фронтэнд-разработчиком. Надо уметь и то, и другое. Неудобно, когда дизайнер рисует картинку в фотошопе, а потом объясняет разработчику, что при наведении сюда вот это двигается на три пикселя вот сюда, а вот это наколняется, а вот тут параллакс... Здорово, когда это делает один человек. См. например The Verge. У них дизайн нельзя отделить от программирования.\\n\\nДедушка Джобс говорил:\\n\\nMost people make the mistake of thinking design is what it looks like. That’s not what we think design is. It’s not just what it looks like and feels like. Design is how it works.\\n\\nЯ пришел в ШРИ, чтобы научиться не рисовать дизайн, а делать его, заставлять страницу работать так, как нужно мне. Чтобы привести в порядок свои знания (я же самоучка, в голове каша) и получить новые. Чтобы общаться с людьми, которые делают то же, что и я, и учиться у них. Пока все это получается и наша школа меня очень радует. Спасибо организаторам, все клево :)","link_photo":"nikita-popov.jpg","link_facebook":"facebook.com\/popov.nikita","link_vk":"vk.com\/nikita.v.popov","link_gihub":"github.com\/losnikitos","link_yaru":"losnikitos123.ya.ru","name":"Никита Попов"},"roman-orlovskiy":{"city":"Нижний Новгород","about":"Обо мне, обо мне, обо мне","link_photo":"roman-orlovskiy.jpg","link_facebook":"","link_vk":"http:\/\/vk.com\/id3776751","link_gihub":"https:\/\/github.com\/Romanaldo\/","link_yaru":"http:\/\/ctuxu-r.ya.ru\/","name":"Роман Орловский"},"vasiliy-loginevskiy":{"city":"Москва","about":"Всем привет, меня зовут Вася. Родился и живу в Москве. В школе вебом, версткой и даже программированием не увлекался, просто мне нравилось ходить на олимпиады по математике и лингвистике. Потом поступил в МИФИ, где любовь к математике мне отбили. С третьего курса работаю. Занимался вебом и ios. В школу пришел чтобы восполнить пробелы в знаниях, узнать как изнутри работает такая большая организация и конечно познакомиться с новыми интересными людьми.","link_photo":"vasiliy-loginevskiy.jpg","link_facebook":"https:\/\/www.facebook.com\/yeti.or","link_vk":"http:\/\/vk.com\/yeti_or","link_gihub":"https:\/\/github.com\/YetiOr","link_yaru":"http:\/\/my.yandex.ru\/Yeti-or\/","name":"Василий Логиневский"},"anton-kuznecov":{"city":"Иваново","about":"Привет! Меня зовут Антон! Мне 21 и я из города невест! В Москве второй год. Попал сюда через три месяца после ДМБ.\\n\\nСлужил в Ракетных Войсках Стратегического Назначения (РВСН). Место службы - 54-я дважды Ордена Кутузова второй степени ракетная дивизия, что находится в Ивановской области (г. Тейково). Двумя годами ранее пришел второй раз в веб-разработку в 11 классе. А с js начал подробно знакомиться уже в армии - Моя тубмочка на службе\\n\\nСлучилось это на волне популярности торрент-трекеров. Вот и я держал некогда небольшой, но разросшийся со временем трекер в локалке Билайна (хотя изначально это была Корбина Телеком, но пока они разворачивали сеть в городе, Билайн успел купить Корбину). Я тогда не был так силен в современных технологиях, да и phpBB движок слишком монструозный. В общем, история закончилась тем, что трекер пришлось закрыть не по своей воле на пике его популярности среди односетчан. Я его породил, но не я его убил. Хотя цели своей я достиг, мой username стал чаще упоминаться на местных форумах.\\n\\nЯ не буду нахваливаться учебными заведением, скажу одно - в школе я был примерным учеником, а вот с учебой в ИГЭУ им. Ленина (Лучший энергетический ВУЗ страны) у меня не сложилось. Я не жалею о том, что в текущий момент не являюсь студентом вовсе. Учеба на инженера по электроснабжению своего профита не дала. И жизнь сложилась так, что сейчас я учусь там, где и должен, где мне нравится - это ШРИ.\\n\\nЯ уверен, что каждый из всех студентов ШРИ, также как и я рад, что он здесь оказался.\\n\\nЗаписываю подкасты. Благодаря этому знаком со некоторыми довольно известными людьми, кстати на ближайшей неделе планирую начать очередные записи (летом записываться бессмысленно, нет аудитории). Если вам интересно, приглашаю послушать WhyBeKey!\\n\\nВот такой он я. Веселый, забавный, порой скучный, педантичный и ленивый. Лучше всего вы меня знаете по толстовке с Железным человеком. До встречи в ШРИ!","link_photo":"anton-kuznecov.jpg","link_facebook":"https:\/\/www.facebook.com\/isnifee","link_vk":"http:\/\/vk.com\/isnifer","link_gihub":"http:\/\/github.com\/isnifer","link_yaru":"http:\/\/isnifer.ya.ru\/","name":"Антон Кузнецов"},"pavel-myagkov":{"city":"Москва","about":"Алоха! Меня зовут Паша. Я родился в далеком 1988 году в Москве, где и вырос.\\n\\nВ 2005 году в свое лоно меня приняла любимая alma mater — Московский Государственный Университет им. М. В. Ломоносова. В ней я нашел свое место на факультете Вычислительной Математики и Кибернетики, благополучно законченном в 2010. Скажу честно — до университета я весьма слабо представлял себе, что такое программирование и с чем его едят. Но я всегда был склонен к решению математических задач и размышлял я о структуризации данных (этот термин я выучил только потом) почти с благоговейным трепетом. Но в студенчестве пришлось взяться за голову и пройти стандартное крещение операторами — Паскаль, языки ассемблера, С, С++. С третьего курса я попал на кафедру Системного Программирования, где начался хардкор со всякой функциональщиной, логическим программированием (от него меня тошнит до сих пор) и так далее.\\n\\nВ процессе обучения я познакомился с теорией TCP\/IP стека и даже поработал с ним на практике — в качестве курсовой писал эмулятор протокола ARP сетевого уровня. И тогда web начал потихоньку засасывать.\\n\\nНа последних курсах работал в студенческой лаборатории Microsoft, что предопределило стек используемых технологий на ближайшее время, постепенно приближаясь к фронтенду. Далее – туристическая компания Ascent Travel, которая недавно обанкротилась (надеюсь, не из-за переписанного с коллегой с нуля сайта). Далее – Dell Software, в которой тружусь и поныне уже в качестве team lead'a со своим проектом.\\n\\nИз интересов: люблю доски в любом их проявлении: скейтборд в прошлом, сноуборд, вейкборд и даже серф. Очень люблю музыку, наверное, сказалось семилетнее обучение в музыкальной школе. Перечислять можно долго, но больше всего я люблю интересное и живое общение. \\n\\nВ школу попал не самым замысловатым образом — прочитал пост на хабре и начал мониторить новый набор. И вот я тут. Вы спросите: «Зачем?». Да потому что мне всегда хотелось делать штуки, пользуясь которыми люди бы улыбались. Но кроме желания нужна и техническая подкованность. А кроме нее — и некая общность людей, близких друг другу по духу. За то время, что я учусь в ШРИ, я понял, что попал в правильное место по всем вышеперечисленным показателям. Остается только впитывать...","link_photo":"pavel-myagkov.jpg","link_facebook":"https:\/\/www.facebook.com\/pmyagkov","link_vk":"http:\/\/vk.com\/muelle","link_gihub":"https:\/\/github.com\/pmyagkov","link_yaru":"http:\/\/p-a-myagkov.ya.ru\/","name":"Павел Мягков"},"yana-manuhina":{"city":"Москва","about":"Всем привет! :) \\nЯ учусь на 4 курсе МГТУ им. Н.Э. Баумана, на кафедре \"Информационные системы и телекоммуникации\". \\n\\nО том, что существуют такие волшебные штуки как html и css, я узнала лет в 11 и примерно тогда же поняла, что мне может быть интересно развиваться в этой области. Затем появился интерес к интерфейсам (любым), а также желание делать их максимально удобными и красивыми. А пару лет назад пришло понимание, что можно объединить эти два направления.\\n\\nВ сентябре прошлого года я увидела раздел ШРИ на Яндекс.событиях и подумала: \"Ага! Вот оно!\". Но оказалось, что я опоздала, и набор закончился 2 дня назад. Оставалось только ждать следующего, сделать вступительные задания и надеяться :)\\n\\nДля меня ШРИ — это возможность развиваться в области фронтенд-разработки. Очень хочу попасть на практику, чтобы получить hands-on experience, и остаться работать в Яндексе.","link_photo":"yana-manuhina.jpg","link_facebook":"https:\/\/www.facebook.com\/yana.manukhina","link_vk":"http:\/\/vk.com\/id1868886","link_gihub":"https:\/\/github.com\/yanenok\/","link_yaru":"http:\/\/yanenok.ya.ru\/","name":"Яна Манухина"},"vasiliy-styajkin":{"city":"Москва","about":"Приветствую.\\nМне 23 года, около 20-ти из которых я провел примерно здесь .\\n\"Hello World!\" написал сам того не зная еще на ZX Spectrum, но гик из меня не получился (и я, признаться, этому рад). \\nУчился в Архангельском Музыкальном Училище на джаззовом отделении. Травма руки это исправила. Спустя некоторое время решил просвещаться в IT. Поработал в тех-поддержке провайдера (привет Уральский). Потратив много свободного времени на освоение html\/css, убежал в обслуживание интернет магазинов, где исправлял кучу кода, который никогда не должен был рождаться, отбил сотни глупых желаний заказчиков. Стало очевидно - я не хочу пополнять ряды \"веб-дестроеров\" (привет с YaC'a)\\nО Школе узнал в процессе поиска обучающих материалов. Через пару месяцев после переезда из Спб в Москву узнал, что в этом году я прибыл в нужное место.\\nСпасибо за возможность реализовать свои планы и указание верного направления.","link_photo":"vasiliy-styajkin.jpg","link_facebook":"--","link_vk":"--","link_gihub":"https:\/\/github.com\/vasyan","link_yaru":"http:\/\/vasilyator9000.ya.ru\/","name":"Василий Стяжкин"},"mihail-shustov":{"city":"Санкт-Петербург","about":"Пожил по всей стране, влюбился в Питер, там и живу последние 2 года.\\nОкончил МЭИ по специальности Автоматизация технологических процессов и производств.  Собственно и работал программистом АСУТП. Писал на ассемблеро-подобных языках и C системы автоматического управления , как правило целых заводов.  Собственно хотелось хардкора и  расти дальше, но скорее как разработчик, а не как руководитель .  Так что год назад просто уволился и открыл книгу Флэнагана и тут понеслось... порадовала необычность асинхронного подхода и широкий спектр решаемых задач, так начал экспериментировать начиная от node.jsи заканчивая мобильными приложениями, подтянул верстку и сделал первые заказы по фрилансу . \\nВ ШРИ пошел чтобы учиться у лучших спецов. Да и сама атмосфера и формат школы дико заряжает -смотришь на окружающих людей и понимаешь какой еще тебе предстоит путь. И это скорее не пугает, а мотивирует.  Так что успехов все нам, пасаны))  ","link_photo":"mihail-shustov.jpg","link_facebook":"https:\/\/www.facebook.com\/mikhail.shust.5","link_vk":"http:\/\/vk.com\/saintpchav","link_gihub":"https:\/\/github.com\/restrry","link_yaru":"http:\/\/restrry.ya.ru\/","name":"Михаил Шустов"},"mariya-meteleva":{"city":"Киров","about":"Всем привет!\\n\\n \\n\\nМеня зовут Маша.\\n\\nЯ приехала в Москву из города Кирова, в 2008 году поступила в Московский Физико-Технический Институт(в народе Физтех), и моя жизнь резко изменилась.\\n\\nК началу второго курса я начала испытывать нежные чувства к С++(что до сих пор не изменилось, потому что первая любовь, как известно, не забывается).\\n\\nСейчас учусь в магистратуре(6 курс) на кафедре \"Компьютерная лингвистика\" и в связи с этим работаю в отделе Semantic Search компании Abbyy(онтологии, InfoExtraction, все дела...).\\n\\n \\n\\nПро ШРИ я узнала давно, случайно наткнувшись на прошлогодние лекции. Посмотрела немного - понравилось. И забылось.\\n\\nНо сейчас я здесь и..ок, обо всем по порядку.\\n\\nТак получилось, что год назад я пошла на дополнительный курс на Физтехе \"Современные методы коллективной разработки ПО\", который должен был иметь логическое завершение в форме проекта, говорящего \"я не зря каждую неделю прогуливала свои пары и слушала эти лекции\".\\n\\nПроект все еще разрабатывается, но, что важно, в процессе было решено реализовать некоторый веб-интерфейс. На протяжении ~полугода я занималась изучением HTML\/CSS\/JS\/etc., что мне очень нравилось, но не хватало систематизации знаний. И в один прекрасный день я вспомнила про ШРИ, увидев пост на хабре.\\n\\nМеня всегда тянуло к людям, которые знают больше чем я, и у которых можно многому научиться. Поэтому я очень рада, что поступила в ШРИ. \\n\\n \\n\\nБольшое спасибо преподавателям школы за замечательные лекции и всем удачи : )","link_photo":"mariya-meteleva.jpg","link_facebook":"https:\/\/www.facebook.com\/prosto42","link_vk":"http:\/\/vk.com\/prosto_koshka","link_gihub":"https:\/\/github.com\/koshka","link_yaru":"http:\/\/kotia292007.ya.ru\/","name":"Мария Метелёва"},"maksim-myalin":{"city":"Зеленоград","about":"Привет!\\n\\nМеня зовут Максим, мне 21 год. Родился и живу в г. Зеленоград.\\n\\nУчусь на 4 курсе НИУ МИЭТ на кафедре Вычислительных систем. \\n\\nПрограммировать начал ещё в школе на Pascal. Потом был C++ и C#. На последний подсел основательно, писал всякие штуки для комьюнити Lockerz.\\n\\nПараллельно с этим начал щупать web. Первым \"шагом\" была Боталка - сайт с учебными материалами для студентов. Работает на CMS Livestreet, которая крутится на облачном сервере. Да, тогда ещё пришлось покурить маны по LAMP, а потом ещё и по nginx. Зато теперь всё стабильно и шустро.\\n\\nБыло и много фриланса. Писал и под OS X, и под iOS, но \"осел\" именно в web-разработке. То, что не стыдно показать, можно посмотреть на Brainstorage.\\n\\nПомимо Боталки пошли и другие собственные проекты. Например, MyBoxes - сервис по отслеживанию посылок. Над ним я работаю вместе с другом дизайнером (подробнее можно почитать у него).\\n\\nБуквально на днях мы запустили сайт с расписанием пар для нашего ВУЗа - http:\/\/shaddy.ru\/. Пока что там всего один курс одного факультета, но всё ещё впереди :)\\n\\nПро ШРИ узнал из статьи на Хабре. Пришёл с целью отшлифовать уже имеющиеся знания, получить новые и попытаться попасть в Яндекс.\\n\\nВ школе особенно нравится \"здоровая IT атмосфера\".\\n \\nStay tuned!","link_photo":"maksim-myalin.jpg","link_facebook":"","link_vk":"http:\/\/vk.com\/maxim.myalin","link_gihub":"https:\/\/github.com\/hungrymarvin","link_yaru":"http:\/\/maximmyalin.ya.ru\/","name":"Максим Мялин"},"dmitriy-dushkin":{"city":"Электросталь","about":"Родился и рос в г. Электросталь Московской области. Поступил в МТУСИ на факультет ИТ. Пару месяцев назад окончил аспирантуру Института проблем управления. Готовлюсь к защите, которая состоится в конце октября. Про диссертацию можно посмотреть тут и почитать тут.\\nИТ увлекаюсь с детства. Интерес к веб-технологиям начался в школе с Flash, потом плавно перерос к HTML, JS, PHP и понеслась. Сейчас из фаворитов это Erlang для серверов, Python для веб-приложений и AngularJS для клиента. Недавно приступил к технологиям, облегчающим быт фронт-эндера: Yeoman, Grunt, Bower.\\nВ институте начинал с фриланса, потом со знакомым открыли небольшую веб-студию. К диплому надо было выбирать: бизнес или хороший диплом (далее аспирантура). Выбрал второе, о чем до сих по не жалею.) Сейчас работаю научным сотрудником в лаборатории №17 ИПУ РАН. Повезло с начальством – часто научные задачи предполагают практическую реализацию, в т.ч. с веб-интерфейсом, поэтому была возможность поизучать что-нибудь новенькое.\\nВ школе интересует тема разработки крупных и сложных веб-проектов. Архитектурные и социальные решения в компаниях уровня Яндекс. Также надеюсь попасть на практику и потом работать в Яндекс.","link_photo":"dmitriy-dushkin.jpg","link_facebook":"","link_vk":"","link_gihub":"https:\/\/github.com\/DimitryDushkin","link_yaru":"http:\/\/legato-di.ya.ru\/","name":"Дмитрий Душкин"},"ashat-nuriddinov":{"city":"Москва","about":"Привет.\\nЯ учусь на третьем курсе мехмата МГУ. Люблю математику и естественные науки, увлекаюсь промышленным дизайном, урбанистикой.\\nПознакомился с веб-технологиями в школе. Недоумевал, почему все не любят ИЕ6, даже после выхода 7-ой и 8-ой версии я оставался на 6-ой, потому что она была гораздо быстрее и новые окна в ней открывались гораздо быстрее, чем новые вкладки в 7-ой. До уровня, на котором начинают понимать, в чём плох ИЕ6 тогда не дорос.\\nНа втором курсе захотелось кушать, начал что-то почитывать про JS, PHP, MySQL.\\nСейчас ощущаю себя в обществе людей, гораздо более продвинутых в этой области, чем я. Это мотивирует меня развиваться.\\nНадеюсь, что в ШРИ я превращусь из любителя в профессионала.","link_photo":"ashat-nuriddinov.jpg","link_facebook":"","link_vk":"https:\/\/vk.com\/askhat","link_gihub":"https:\/\/github.com\/geromond","link_yaru":"http:\/\/geromond.ya.ru\/","name":"Асхат Нуриддинов"},"sergey-popov":{"city":"Москва","about":"Родился и вырос в Москве.\\nПрограммировать начал в детском клубе \"Компьютер\"http:\/\/www.child.ru\/about.html мы там выполняли разные задания на языках Basic, Logo, Z-80 Assembler. От преподавателей перенял увлечение программированием. Работал компьютерным лаборантом в школе.\\nПервый опыт с веб-разработкой в 2004 году, страничка показывала дерево Ethernet-сети и вероятные проблемные узлы.\\n\\nВ какой-то момент JavaScript внезапно впечатлил выразительностью кода, для меня это первый язык основанный на прототипах.\\n\\nДля своевременного осваивания JavaScript (CSS, UI) разрабатываю SPA-проект, связанный с параметрическими расчетами, как смог обобщил предмет и интерфейс, пример можно посмотреть здесь http:\/\/acidome.ru\/lab\/calc\/next.html#1\/2_Class_II_Cone_4V_R4.2_beams_100x100 \\nЕсть сообщество, для которого затеен данный проект, приятно осознавать, что твоя программа может быть полезной. Еще фишка в том, что данные расчеты сложно произвести самому и не каждому под силу. Вспоминается случай, письмо из Бразилии от учителя, который жаловался что программа не работает если страницу закачать себе на комп, он хотел показать детям где-то в сельской местности, где нет инета. Со временем появился такой функционал.\\n\\nПолтора года работал над порталом http:\/\/www.gosuslugi.ru\/, из интересного двухстронняя шаблонизация и обобщение для форм, научили их работать по декларативному описанию, без кода. Сейчас работаю JavaScript-разработчиком на http:\/\/www.rabota.ru\/ тут много чего нужно улучшать.\\n\\nЧлен Пиратской партии России.\\n\\nКоллега на работе показал форму с задачками, потом пришло письмо с приглашением в ШРИ.\\nПришел для получения знаний и опыта, решать задачки. Затея со школой мне нравится.","link_photo":"sergey-popov.jpg","link_facebook":"https:\/\/www.facebook.com\/profile.php?id=100001345209443","link_vk":"http:\/\/vk.com\/popitch","link_gihub":"https:\/\/github.com\/popitch","link_yaru":"http:\/\/popitch.ya.ru\/","name":"Сергей Попов"},"dmitriy-starostin":{"city":"Железнодорожный","about":"Привет, меня зовут Дима, мне 25.\\n\\nРодился в подмосковном Железнодорожном, недавно переехал в Москву. Учился в неплохой московской школе, английский и информатика были с первого класса. В старших классах познакомился с QBasic'ом и узнал что, оказывается, программирование это весело. Писал какой-то адский нечитабельный код с кучей goto и gosub, при виде которого сейчас у меня идёт кровь из глаз. \\n\\nПолучил высшее образование в РГУИТП, на кафедре \"Информационные системы\". После этого работал пару лет в НИИ информационных технологий и телекоммуникаций при университете, но строить научную карьеру не стал, ушёл в кровавый энтерпрайс.\\n\\nСейчас работаю в московском R&D центре компании Huawei чуть меньше двух лет, занимаюсь поддержкой и доработкой решений Huawei для телекома. В основном это веб-порталы и голосовые меню (IVR) для доступа к сервисам телеком операторов. Очень люблю свою команду, но периодически страдаю от качества китайско-индусского кода, с которым приходится работатать.\\n\\nПро ШРИ узнал из промо-ролика, мотивирующий пост на хабре прочитал уже после того как отправил анкету. Хочу прорваться на стажировку в Яндекс и стать крутым фронтэнд-разработчиком. Я чувствую у себя достаточно много пробелов в знаниях и навыках связанных с веб-разработкой (переже всего с вёрсткой). Школа для меня - это отличный шанс заполнить эти пробелы, а также пообщаться с настоящими живыми людьми. ","link_photo":"dmitriy-starostin.jpg","link_facebook":"https:\/\/www.facebook.com\/dmitry.pasechnik.169","link_vk":"","link_gihub":"https:\/\/github.com\/incrop","link_yaru":"http:\/\/dee-starostin.ya.ru\/","name":"Дмитрий Старостин"},"sergey-maksimov":{"city":"Москва","about":"Три года назад я получил диплом инженера в РХТУ им. Менделеева. Уже с 4 курса начал заниматься разработкой приложений. Первоначально это были \"толстые\" клиенты. Со временем удалось получить опыт работы с различными СУБД, а также написания своих и интеграции чужих веб-сервисов. Параллельно основной работе в качестве хобби изучал администрирование ОС Linux. На данном этапе мои рабочие задачи включают в себя разработку интерфейса для ряда заказных систем.\\n\\nВ рамках школы хотел бы заполнить пробелы в знаниях технологии разработки хороших пользовательских интерфейсов.","link_photo":"sergey-maksimov.jpg","link_facebook":"","link_vk":"","link_gihub":"https:\/\/github.com\/Unlocker","link_yaru":"http:\/\/hakerxnet.ya.ru\/","name":"Сергей  Максимов"}}
