[{"name":"","lection":"Командная строка Unix","url":"/lectures/komandnaya-stroka-Unix","task":"- Найти и заменить во всех файлах .html подстроку КИТ на ШРИ в тэге &lt;title>&lt;/title><br>- Обеспечить возможность отмены изменения.","about":"","git":"https://github.com/phpprog/test-terminal","demo":""},{"name":"","lection":"Языки программирования","url":"/lectures/yaziki-programmirovaniya","task":"Есть направленный граф, каждое ребро имеет вес. Написать функцию, возвращающую стоимость и оптимальный маршрут между двумя вершинами.<BR><BR>1) на хаскелле<BR>2) на любом незнакомом языке","about":"Чтобы вспомнить алгоритм - для начала реализовал на javascript. Затем стал разбираться с Haskell ... и даже поверхностно разобрался, но до написания полноценной функции дело так и не дошло. Из незнакомых языков выбрал Python. С реализацией алгоритма на py проблем не возникло.","git":"https://github.com/phpprog/Dijkstra-s-Algorithm--.hs-","demo":""},{"name":"","lection":"","url":"","task":"Написать ScreenSaver","about":"Программа моделирует поведение нескольких стай рыб. С ростом количества рыб нагрузка на ядро процессора возрастает до 100%. В клубе выяснили, что переход на canvas не поможет снизить нагрузку, т.к. узким местом является неоптимальный алгоритм поведения рыб, а не перерисовка div'ов.","git":"https://github.com/phpprog/ScreenSaver-Battle","demo":"http://t1.kiev.ua/battle/"},{"name":"Конкурс на Yac по ускорению отрисовки страницы","lection":"","url":"","task":"Оптимизировать статичную страницу, сверстанную с множеством ошибок. Это можно сделать как на своем компьютере, так и на одном из гостевых ноутбуков на стенде во время конференции.","about":"<b>В конкурсе занял 10-е место.</b><br>Что было сделано:<BR>- Изображения были сохранены под web<BR>- Javascript, который вставлял текст через document.write, был удалён, а необходимый текст вставлен в HTML<BR>- Удалён js скрипт, который после окончания загрузки страницы выбирал изображение по нескольким селекторам, после чего заменял изображение на другое<BR>- Маленькие иконки из меню (5 или 6 штук) были вставлены в HTML через base64<BR>- Сборка и минимизация js / css файлов борщиком и перенос в конец файла<BR>- Удаление неиспользуемых символов из шрифтов<BR>- Удаление комментариев из HTML и сжатие в 1 строку<BR><BR>Почему 10-е место, а не 1-е:<BR><BR>- Из шрифтов удалил не все неиспользуемые символы и то что у меня получилось можно было сжать ещё в 4 раза<BR>- У изображений в шапке можно было уменьшить разрешение и склеить в одно<BR>- Удалить неиспользуемые селекторы из css<BR>- Удалить неиспользуемые JS скрипты или преобразовать в HTML","git":"https://github.com/phpprog/yac2013","demo":"https://github.com/yandex-cs/yac2013/blob/gh-pages/RESULTS.md"}]
